Revit 2024 API
PathReinSpanSymbol Class
 Represents a Path Reinforcement Span Symbol element in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class PathReinSpanSymbol : IndependentTag
Visual Basic
Public Class PathReinSpanSymbol _
	Inherits IndependentTag
Visual C++
public ref class PathReinSpanSymbol : public IndependentTag
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.Structure.PathReinSpanSymbol
See Also
PathReinSpanSymbol Members
Autodesk.Revit.DB.Structure Namespace